# 데이터 handling

- 데이터 구조 
    - Series
    - DataFrame
- 데이터 읽기 및 저정
    - Series 구조 데이터 생성하기
    - DataFrame 구조 데이터 생성하기 
- 데이터 내용 확인 
    - 데이터 읽어오기 
    - 데이터의 내용 미리보기 
    - 요약정보 확인하기 
    - 데이터 개수 및 집계함수 활용

## 데이터 구조 
- pandas 패키지란?
    - 데이터를 수집하고 정리하는데 최적화된 도구
        - numpy 기반으로 작성된 라이브러리로 데이터 불러오기 , 전처리 , 통계분석에 사용
        - Series 형태와 DataFrame 형태의 자료구조 존재 
        - 실무에서 접하는 엑셀 파일의 스프레드 시트가 DataFrame 형태임
        - 데이터 분석에 있어서 필수적인 라이브러리로 데이터 전처리시 대부분은 pandas를 사용함 

- 데이터 구조 
    - Series: 1차원 배열 구조로 index와 values로 구성
    - DataFrame: spreadsheet(m*n)의 행렬 구조 형식의 자료구조로 inde, columns, values 형태로 구성

### 연습

In [2]:
# 패키지 불러오기 
import pandas as pd

In [3]:
dict_data={'a':1,"b":2,"c":3}
sr=pd.Series(dict_data)
print(type(sr))
print(sr)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [4]:
table={"일자":['2019-01-01','2019-01-04','2017-01-07','2019-01-10','2019-01-13'],
      "가격":[1000,1500,2000,2500,3000],
      "구매여부":['False','True','True','True','True'],
      "제품":['gum','snack','beverage','dongas','alchoal']}

df=pd.DataFrame(table)
df

           일자    가격   구매여부        제품
0  2019-01-01  1000  False       gum
1  2019-01-04  1500   True     snack
2  2017-01-07  2000   True  beverage
3  2019-01-10  2500   True    dongas
4  2019-01-13  3000   True   alchoal

### 실습 1.

In [6]:
name={1:"홍길동",2:"아순신",3:"강감찬"}

name_df=pd.Series(name)
name_df

1    홍길동
2    아순신
3    강감찬
dtype: object

In [8]:
score={"성명":["홍길동","이순신",",강감찬","이성계","정약용"],"국어성적":[90,95,85,90,95],
      "영어성적":[90,85,90,95,95],"수학성적":[95,90,85,75,90]}

score_df=pd.DataFrame(score)
score_df

     성명  국어성적  영어성적  수학성적
0   홍길동    90    90    95
1   이순신    95    85    90
2  ,강감찬    85    90    85
3   이성계    90    95    75
4   정약용    95    95    90

In [10]:
df=pd.read_csv("./FITNESS.csv" , encoding='euc-kr')
df.head()

,NAME,GENDER,AGE,AGEGROUP,WEIGHT,OXY,RUNTIME,RUNPULSE,RSTPULSE,MAXPULSE
0,Donna,여성,42,40대,68.15,59.571,8.17,166,40,172
1,Gracie,여성,38,30대,81.87,60.055,8.63,170,48,186
2,Luanne,여성,43,40대,85.84,54.297,8.65,156,45,168
3,Mimi,여성,50,50대,70.87,54.625,8.92,146,48,155
4,Chris,남성,49,40대,81.42,49.156,8.95,180,44,185

In [14]:
df=pd.read_excel("./성적처리.xlsx" , sheet_name='Sheet1')
df.head()

    반   성명  국어  영어  수학  사회  과학
0  1반  홍길동  93  80  94  73  64
1  5반  백일홍  93  63  76  84  92
2  3반  이삼상  94  74  86  90  70
3  4반  정말로  83  55  64  90  65
4  5반  한번도  87  95  66  75  60

### 실습 2.

In [28]:
df=pd.read_csv("./성적.csv" , encoding='euc-kr',index_col=0)
df

    성명  국어성적  영어성적  수학성적
0  홍길동    90    90    95
1  이순신    95    85    90
2  강감찬    85    90    85
3  이성계    90    95    75
4  정약용    95    95    90

In [29]:
df.to_csv("./성적실습.csv")

# 데이터 내용확인

In [ ]:
df=pd.rea

In [1]:
df.head()

NameError: name 'df' is not defined